src/ws-request/getAbilitiesRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://bankaya.com/examen/test/pokemon">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getAbilitiesRequest>
            <gs:pokemon>charmander</gs:pokemon>
        </gs:getAbilitiesRequest>
    </soapenv:Body>
</soapenv:Envelope>